In [2]:
import pandas as pd

In [3]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],  
        'Age':[27, 24, 22, 32],  
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}  
df = pd.DataFrame(data) 
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

### Select two columns

In [12]:
for i in range(df.shape[0]):
    print(df.loc[i,['Name','Qualification']])

Name             Jai
Qualification    Msc
Name: 0, dtype: object
Name             Princi
Qualification        MA
Name: 1, dtype: object
Name             Gaurav
Qualification       MCA
Name: 2, dtype: object
Name             Anuj
Qualification     Phd
Name: 3, dtype: object

In [15]:
df.loc[:,['Name','Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

#### First filtering rows and selecting columns by label format and then Select all columns.

In [17]:
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [18]:
df.loc[0,:]

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

#### Select all or some columns, one to another using .iloc.

In [21]:
df.iloc[[0,1,2],1:3]

   Age    Address
0   27      Delhi
1   24     Kanpur
2   22  Allahabad